       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SUB.
       DATA DIVISION.
      * Comment
       LINKAGE SECTION. 
       COPY STUDENT.

       PROCEDURE DIVISION USING LS-STUDENT-NAME .
           DISPLAY "In SUB" 
           MOVE FUNCTION UPPER-CASE("SUB") TO LS-STUDENT-NAME 
           GOBACK .
